[
    {
        "department": "EECS",
        "number": "183",
        "name": "Elem. Programming Concepts",
        "grade": "A",
        "credits": "4.0",
        "score": "83",
        "favorite": false,
        "taken": "no",
        "description": "Fundamental concepts and skills of programming in a high level language. Flow of control: selection, iteration, subprograms. Data structures: strings, arrays, records, lists, tables. Algorithms using selection and iterations (decision making, finding maxima/minima, searching, sorting, simulation, etc.). Good program design, structure, and style are emphasized. Testing and debugging. Not intended for Engineering students (who should take ENGR 101), nor for CS majors who qualify for EECS 280.",
        "comment" : "Where even the most technophobic students can overcome their fear of code and become programming ninjas in no time, all while having a blast!"
    },
    {
        "department": "EECS",
        "number": "110",
        "name": "Discover CS",
        "grade": "A+",
        "credits": "2.0",
        "score": "67",
        "favorite": false,
        "taken": "no",
        "description": "Discover Computer Science --- Introduction to basic CS concepts (variables, conditionals, loops, functions) using an introductory programming language, such a Python. Students interact with researchers and computing professionals to learn about real-world, interdisciplinary applications of CS. Intended for students without prior programming experience to (optionally take prior to EECS 183 or ENGR 101.",
        "comment" : "It is like the appetizer before a coding feast, giving you a tasty introduction to programming concepts that'll leave you hungry for more!"
    },
    {
        "department": "EECS",
        "number": "198",
        "name": "Special Topics",
        "grade": "A",
        "credits": "1.0-4.0",
        "score": "95",
        "favorite": false,
        "taken": "no",
        "description": "Topics of current interest selected by the faculty.",
        "comment" : "It is like a rollercoaster ride through the world of first-year computer science projects, where students buckle up and learn teamwork, problem-solving, and programming in one thrilling semester!"
    },
    {
        "department": "EECS",
        "number": "200",
        "name": "Elec Eng Sys Des I",
        "grade": "A",
        "credits": "2.0",
        "score": "59",
        "favorite": "no",
        "taken": "no",
        "description": "Electrical Engineering Systems Design I --- Gain a systems engineering perspective of electrical engineering centered around a design competition to address a societally-relevant challenge. Apply electrical engineering concepts in circuits, computing, control, sensors, optics, power, signal processing, and wireless communications to a system such as a robot and adapt the system to achieve competition objectives within defined engineering constraints. Projects are overseen and graded by faculty and may also involve mentoring by representatives from industrial, governmental and/or non-profit organizations.",
        "comment" : "It is where computer wizards-in-training can uncover the magical world of electronic circuits, conjuring up a deeper understanding of how the tiny building blocks of technology work together!"
    },
    {
        "department": "EECS",
        "number": "201",
        "name": "Computer Science Pragmatics",
        "grade": "A+",
        "credits": "1.0",
        "score" : "86",
        "favorite": "no",
        "taken": "no",
        "description": "Designed to teach the essentials of using a computer effectively. Topics covered include shells, environment, scripting, Makefiles, compilers, debugging tools, and version control.",
        "comment" : "It is like a wild treasure hunt, where eager students dig deep into discrete mathematics, unearthing gems of logic and problem-solving techniques that will power their computer science journey!"
    },
    {
        "department" : "EECS",
        "number" : "203",
        "name" : "Discrete Math",
        "grade" : "B",
        "credits" : "4.0",
        "score" : "39",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Introduction to the mathematical foundations of computer science. Topics covered include: prepositional and predicate logic, set theory, function and relations, growth of functions and asymptotic notation, introduction to algorithms, elementary combinatorics, and graph theory, and discrete probability theory.",
        "comment" : "It is like a secret decoder ring for computer scientists, unlocking the mysteries of discrete math and logic that form the backbone of algorithms, making even the toughest problems seem like child's play!"
    },
    {
        "department" : "EECS",
        "number" : "215",
        "name" : "Introduction to Electric Circuits",
        "grade" : "A-",
        "credits" : "4.0",
        "score" : "66",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Basic Concepts of voltage and current; Kirchhoff's voltage and current laws; Ohm's law; voltage and current sources; Thevenin and Norton equivalent circuits; DC and low frequency active circuits using operational amplifiers, diodes, and transistors; small signal analysis; energy and power. Time-and frequency-domain analysis of RLC circuits. Basic passive and active electronic filters. Laboratory experience with electrical signals and circuits.",
        "comment" : "It is where students morph into electrical engineering superheroes, using their newfound powers to conquer the captivating world of circuits, signals, and systems in a single bound!"
    },
    {
        "department" : "MATH",
        "number" : "214",
        "name" : "Applied Linear Algebra",
        "grade" : "B+",
        "credits" : "4.0",
        "score" : "43",
        "favorite" : "no",
        "taken" : "no",
        "description" : "This course is an introduction to matrices and linear algebra, with an emphasis on concepts and problem solving. It is particularly designed for students who are planning to take a course in linear programming or computer science.",
        "comment" : "It is like a rollercoaster ride through the multidimensional world of linear algebra, where students buckle up and enjoy the thrilling journey of vector spaces, eigenvalues, and mind-bending transformations!"
    },
    {
        "department" : "WGS",
        "number" : "304",
        "name" : "Gender and Immigration: Identity, Race, and Place",
        "grade" : "A-",
        "credits" : "3.0",
        "score" : "95",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Refugees, migrants, immigrants, diaspora groups, and transnational actors are all terms that describe people who undertake different acts of mobility or travel across borders. But how are these terms different? This course focuses on these various acts of mobility (travel) to show how they are labeled differently under different political and social circumstances. We examine the gendered cultural and political meanings people and governments give to mobility, border crossing, and displacement in this significant age of globalization, transnational mobility, and search of refuge. We will examine the meanings of travel and border crossing in relation to popular concepts such as refugee-ness, diaspora, and transnationalism. Have the meanings of these terms been useful in understanding the social constructions of gender identities, race, ethnicity, xenophobia, and even health and reproduction? We will particularly explore how questions of power, race, and class intersect to shape refugees and immigrants' daily struggles for justice and demands of inclusion in the rubrics of both national and transnational imagined communities. How do refugees and immigrants attempt to create and imagine their own social world with reference to their new locations and their homelands? And how their imaginations are interrupted by complex socio-economic and political realities? Our readings and discussion will focus on cultural and theoretical perspectives from the social sciences, specifically anthropology, history, literature, and political science. And we will take as examples the ethnographies and narratives of immigrants from different parts of the world, specifically Africa, the Middle East Asia, and Latin America.",
        "comment" : "It is like an eye-opening journey through the pages of a living history book, where students delve into the fascinating world of feminist thought and activism, sparking conversations and challenging the status quo with every turn!"
    },
    {
        "department" : "EECS",
        "number" : "493",
        "name" : "User Interface Development",
        "grade" : "A",
        "credits" : "4.0",
        "score" : "78",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Concepts and techniques for designing computer system user interfaces to be easy to learn and use, with an introduction to their implementation. Task analysis, design of functionality, display and interaction design, and usability evaluation. Interface programming using an object-oriented application framework. Fluency in a standard object-oriented programming language is assumed.",
        "comment" : "It is like a playground for aspiring app designers, where students dive into the fun-filled world of UI/UX, creating digital masterpieces that'll make users swoon with delight and come back for more!"
    },
    {
        "department" : "BIOINF",
        "number" : "463",
        "name" : "Mathematical Modeling in Biology",
        "grade" : "A-",
        "credits" : "3.0",
        "score" : "68",
        "favorite" : "no",
        "taken" : "no",
        "description" : "An introduction to the use of continuous and discrete differential equations in the biological sciences. Modeling in biology, physiology and medicine.",
        "comment" : "It is like a thrilling detective adventure, where students turn into bioinformatics sleuths, using cutting-edge computational tools to unravel the mysteries hidden within the twists and turns of DNA sequences!"
    },
    {
        "department" : "EECS",
        "number" : "482",
        "name" : "Introduction to Operating Systems",
        "grade" : "B+",
        "credits" : "4.0",
        "score" : "88",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Operating system design and implementation: multi-tasking; concurrency and synchronization; inter-process communication; deadlock; scheduling; resource allocation; memory and storage management; input-output; file systems; protection and security. Students write several substantial programs dealing with concurrency and synchronization in a multi-task environment, with file systems, and with memory management.",
        "comment" : "It is like a backstage pass to the computer's inner workings, where students become operating system maestros, orchestrating symphonies of processes and resources that keep our digital world humming in harmony!"
    },
    {
        "department" : "EECS",
        "number" : "370",
        "name" : "Introduction to Computer Organization",
        "grade" : "B+",
        "credits" : "4.0",
        "score" : "63",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Basic concepts of computer organization and hardware. Instructions executed by a processor and how to use these instructions in simple assembly-language programs. Stored-program concept. Data-path and control for multiple implementations of a processor. Performance evaluation, pipelining, caches, virtual memory, input/output.",
        "comment" : "It is like a fascinating trip to the heart of a computer, where students uncover the digital wizardry of computer organization and design, transforming raw bits and bytes into computing marvels!"
    },
    {
        "department" : "WGS",
        "number" : "220",
        "name" : "Perspectives in Women's Health",
        "grade" : "A",
        "credits" : "3.0",
        "score" : "83",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Perspectives in Women's Health --- A feminist perspective on concepts and issues in women's individual and aggregate health. Course will include definitions of women's health, women's health concerns, and impact of multiple factors on health.",
        "comment" : "WGS220 at the University of Michigan is a course focused on the study of gender and sexuality, examining issues such as gender identity, sexual orientation, intersectionality, and social justice. It sounds like a fascinating course that could open up new perspectives and challenge one's preconceptions. Have fun learning and exploring!"
    },
    {
        "department" : "WGS",
        "number" : "408",
        "name" : "Gender&Health E Asia",
        "grade" : "A",
        "credits" : "3.0",
        "score" : "NA",
        "favorite" : "no",
        "taken" : "no",
        "description" : "Women, Gender, and Health in East Asia: Historical and Contemporary Perspectives --- This course examines three historical themes: how different people in China, Japan, and Korea defined what it meant to be a healthy man or woman; the relative roles of male and female practitioners in health care; and how imperialism, modernization, and nation-building created new models of gender and health.",
        "comment" : "An interesting and important course that explores the intersections of gender and health in East Asian cultures."
    },
    {
        "department" : "WGS",
        "number" : "330",
        "name" : "Feminist Thought",
        "grade" : "A",
        "credits" : "3.0",
        "score" : "81",
        "favorite" : "no",
        "taken" : "no",
        "description" : "This interdisciplinary course explores multiple perspectives on gender, sexuality, feminism, and feminist theory. We will study movements and theoretical frameworks that are often defined as the 'foundations' of feminism in the U.S. Students will examine women of color, post-colonial, and transnational feminisms.",
        "comment" : "I heard that in WGS 330 at UMICH, they're teaching students how to perfect the art of mansplaining - just kidding! It's actually a great course that explores the complexities and nuances of feminist theory, so no mansplaining allowed!"
    }

]